# Brewfile for bootstrapping macOS development environment
# Usage: brew bundle install

# Taps
tap "chainguard-dev/tap"
tap "hashicorp/tap"
tap "homebrew/cask"
tap "isen-ng/dotnet-sdk-versions"
tap "localstack/tap"
tap "romkatv/powerlevel10k"
tap "terrastruct/tap"

# Core Development Tools
brew "asdf"                           # Version manager
brew "git"
brew "gh"                             # GitHub CLI
brew "git-filter-repo"
brew "jq"                             # JSON processor
brew "wget"
brew "fswatch"

# Shell & Terminal
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "powerlevel10k"

# Cloud & DevOps - AWS
brew "awscli"
brew "cloudflared"
brew "eksctl"
brew "helm"
brew "k9s"
brew "kubectl"
brew "stern"
brew "terraform"
brew "sops"

# Cloud & DevOps
brew "argocd"
brew "chainctl"                       # Chainguard
brew "localstack-cli"

# Databases
brew "libpq"                          # PostgreSQL client
brew "sqlcmd"

# Development Languages & Runtimes
brew "node"
brew "nvm"
brew "yarn"
brew "deno"
brew "python@3.14"
brew "python@3.13"
brew "python@3.12"
brew "python@3.11"
brew "pyenv"
brew "pipx"
brew "openjdk@17"
brew "mono"
brew "nuget"

# Security & Secrets
brew "gnupg"
brew "pinentry"
brew "pinentry-mac"
brew "snyk-cli"

# Testing & Performance
brew "k6"
brew "siege"

# Utilities
brew "gnu-sed"
brew "d2"                             # Diagram tool
brew "graphviz"
brew "tala"

# Video Processing (ffmpeg dependencies)
brew "ffmpeg"

# =============================================================================
# GUI Applications (Casks)
# =============================================================================

# Password Management
cask "1password"
cask "1password-cli"
cask "bitwarden"

# Browsers
cask "arc"
cask "google-chrome"

# Development Tools
cask "cursor"
cask "visual-studio-code"
cask "iterm2"
cask "jetbrains-toolbox"
cask "postman"
cask "bruno"

# .NET SDKs
cask "dotnet-sdk9-0-300"
cask "dotnet-sdk9"
cask "dotnet-sdk8-0-400"
cask "dotnet-sdk8"
cask "dotnet-sdk7-0-200"
cask "dotnet-sdk7-0-100"
cask "dotnet-sdk6-0-400"

# Cloud Tools
cask "microsoft-azure-storage-explorer"
cask "openvpn-connect"

# Communication
cask "slack"
cask "zoom"
cask "whatsapp"
cask "loom"

# Productivity
cask "rectangle"                      # Window management
cask "maccy"                          # Clipboard manager
cask "meetingbar"                     # Calendar in menu bar

# Other
cask "spotify"
